Услуги/src/Documents/ОказаниеУслуги/ОказаниеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслуги</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Услуги/src/Documents/ОказаниеУслуги/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьНоменклатуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	ТекущаяСтрока = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	
	// Установить цену.
	ТекущаяСтрока.Цена = РаботаСоСправочникамиВызовСервера.РозничнаяЦена(Объект.Дата, ТекущаяСтрока.Номенклатура);
		
КонецПроцедуры
#КонецОбласти
